# Jesus Bolivar
## Week 12 11/7/2023
### Python - Pandas series and DataFrame

## Key features of Pandas
-Fast efficient Dataframe object with default and customized indexing
- tools for loading data into in-memory data objects from differenet file formats
- data allignment and integrated handling of missing data
- reshaping and piovting of data sets
- label-based slicing
- columns from a data structure can be deleted or inserted
- group by data for aggregation and transformations
- high performance merging and joining of data
- Time series functionality

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
pd.__version__

'1.0.5'

In [3]:
# panda series 
# A panda series is like a column in a table, one dimensional array holding datat of any type
s = pd.Series(np.arange(1,15))
s

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
dtype: int32

In [4]:
s = Series(np.arange(10,51))
s

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
11    21
12    22
13    23
14    24
15    25
16    26
17    27
18    28
19    29
20    30
21    31
22    32
23    33
24    34
25    35
26    36
27    37
28    38
29    39
30    40
31    41
32    42
33    43
34    44
35    45
36    46
37    47
38    48
39    49
40    50
dtype: int32

In [5]:
type(s)

pandas.core.series.Series

In [6]:
s.index

RangeIndex(start=0, stop=41, step=1)

In [7]:
s = Series([10,20,30,40], index = ["w","x","y","z"])
s

w    10
x    20
y    30
z    40
dtype: int64

In [8]:
s["x"]

20

In [9]:
s["w"]

10

In [10]:
s = Series(np.array(['a','b','c','d']), index=np.arange(100,104))
s

100    a
101    b
102    c
103    d
dtype: object

In [11]:
s.index

Int64Index([100, 101, 102, 103], dtype='int64')

In [12]:
s.values

array(['a', 'b', 'c', 'd'], dtype=object)

In [13]:
so = Series([2520,1127,937,847,713], index=['USA', 'Russia', 'Germany', 'UK', 'France'])
so

USA        2520
Russia     1127
Germany     937
UK          847
France      713
dtype: int64

In [14]:
so['USA']

2520

In [15]:
so[0]

2520

In [16]:
so[so > 800]

USA        2520
Russia     1127
Germany     937
UK          847
dtype: int64

In [17]:
'France' in so

True

In [18]:
so

USA        2520
Russia     1127
Germany     937
UK          847
France      713
dtype: int64

In [19]:
type(so)

pandas.core.series.Series

In [20]:
so_dict = so.to_dict()
so_dict

{'USA': 2520, 'Russia': 1127, 'Germany': 937, 'UK': 847, 'France': 713}

In [21]:
so_from_dict = Series(so_dict)
so_from_dict

USA        2520
Russia     1127
Germany     937
UK          847
France      713
dtype: int64

In [22]:
countries = ['Russia', 'France', 'Spain', 'Germany', 'USA', 'UK', 'Italy']

In [23]:
so2 = Series(so_dict,index=countries)
so2

Russia     1127.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [24]:
pd.isnull(so2)

Russia     False
France     False
Spain       True
Germany    False
USA        False
UK         False
Italy       True
dtype: bool

In [25]:
pd.notnull(so2)

Russia      True
France      True
Spain      False
Germany     True
USA         True
UK          True
Italy      False
dtype: bool

In [26]:
so

USA        2520
Russia     1127
Germany     937
UK          847
France      713
dtype: int64

In [27]:
so2

Russia     1127.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [28]:
len(so)

5

In [29]:
len(so2)

7

In [30]:
so + so2

France     1426.0
Germany    1874.0
Italy         NaN
Russia     2254.0
Spain         NaN
UK         1694.0
USA        5040.0
dtype: float64

In [31]:
s

100    a
101    b
102    c
103    d
dtype: object

In [32]:
so.name="Summer Olympic"
so2.name="Summer Olympic"

In [33]:
so

USA        2520
Russia     1127
Germany     937
UK          847
France      713
Name: Summer Olympic, dtype: int64

In [34]:
so2

Russia     1127.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympic, dtype: float64

In [35]:
so.index.name="Country"
so2.index.name="Country"

In [36]:
so

Country
USA        2520
Russia     1127
Germany     937
UK          847
France      713
Name: Summer Olympic, dtype: int64

In [37]:
so2

Country
Russia     1127.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympic, dtype: float64

In [38]:
# DataFrame
# 2 dimensional data structure, like a 2 dimensional array
my_dict = {'cars': ["GMC", "Toyota", "Ford"],
                'seats': [8,5,7]
            }

In [39]:
my_dict

{'cars': ['GMC', 'Toyota', 'Ford'], 'seats': [8, 5, 7]}

In [40]:
type(my_dict)

dict

In [41]:
df = DataFrame(my_dict)
df

     cars  seats
0     GMC      8
1  Toyota      5
2    Ford      7

In [42]:
data = {
    "calories": [420,380,390],
    "fruits": ['Orange', 'Banana', 'Grape']
}
df = pd.DataFrame(data)
df

   calories  fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [43]:
df.describe

<bound method NDFrame.describe of    calories  fruits
0       420  Orange
1       380  Banana
2       390   Grape>

In [44]:
df.info

<bound method DataFrame.info of    calories  fruits
0       420  Orange
1       380  Banana
2       390   Grape>

In [45]:
# locate row
df.loc[0]

calories       420
fruits      Orange
Name: 0, dtype: object

In [46]:
d = df.loc[1]
d

calories       380
fruits      Banana
Name: 1, dtype: object

In [47]:
type(d)

pandas.core.series.Series

In [48]:
df

   calories  fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [49]:
df.loc[[0,2]]

   calories  fruits
0       420  Orange
2       390   Grape

In [50]:
df.loc[0:2]

   calories  fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [51]:
df.loc[0:1]

   calories  fruits
0       420  Orange
1       380  Banana

In [52]:
my_dict = { 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000,2001,2002,2001,2002,2003],
    'pop': [1.5,1.7,3.6,2.4,2.9,3.2]
}

df2= DataFrame(my_dict)

In [53]:
df2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [54]:
df2.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [55]:
df2.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [56]:
df2.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [57]:
df2.tail(3)

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [58]:
df3 = DataFrame(my_dict, columns=['year','state','pop']) #reorder the columns
df3

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [59]:
df4 = DataFrame(my_dict, columns=['year','state','pop','debt'],
               index=['one', 'two', 'three', 'four', 'five', 'six']) #reorder the columns
df4

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [60]:
df4.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [61]:
df4['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [62]:
df4['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [63]:
df4.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [64]:
df4

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [65]:
df4.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [66]:
df4['debt']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: debt, dtype: object

In [67]:
df4['debt'] =10.5

In [68]:
df4

       year   state  pop  debt
one    2000    Ohio  1.5  10.5
two    2001    Ohio  1.7  10.5
three  2002    Ohio  3.6  10.5
four   2001  Nevada  2.4  10.5
five   2002  Nevada  2.9  10.5
six    2003  Nevada  3.2  10.5

In [69]:
df4['dept'] = np.random.randint(5,10)

In [70]:
df4

       year   state  pop  debt  dept
one    2000    Ohio  1.5  10.5     7
two    2001    Ohio  1.7  10.5     7
three  2002    Ohio  3.6  10.5     7
four   2001  Nevada  2.4  10.5     7
five   2002  Nevada  2.9  10.5     7
six    2003  Nevada  3.2  10.5     7

In [71]:
del df4['debt']

In [72]:
df4

       year   state  pop  dept
one    2000    Ohio  1.5     7
two    2001    Ohio  1.7     7
three  2002    Ohio  3.6     7
four   2001  Nevada  2.4     7
five   2002  Nevada  2.9     7
six    2003  Nevada  3.2     7

In [73]:
df4['dept'] = np.arange(6.0)

In [74]:
df4

       year   state  pop  dept
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [75]:
df4['dept'] = np.random.randn(6)

df4

In [76]:
df4

       year   state  pop      dept
one    2000    Ohio  1.5 -1.386856
two    2001    Ohio  1.7 -0.571122
three  2002    Ohio  3.6 -0.686671
four   2001  Nevada  2.4 -0.819090
five   2002  Nevada  2.9  0.258749
six    2003  Nevada  3.2 -1.092039

In [77]:
s = Series([-1.2,-1.5,-1.7,], index=['two','four','five'])
s

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [78]:
df4['dept']=s

In [79]:
df4

       year   state  pop  dept
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [80]:
df4['eastern']=df4['state']=='Ohio'

In [81]:
df4

       year   state  pop  dept  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [82]:
df4.columns

Index(['year', 'state', 'pop', 'dept', 'eastern'], dtype='object')

In [83]:
del df4['eastern']

In [84]:
df4

       year   state  pop  dept
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [85]:
import pandas as pd
from pandas import *

In [86]:
data = {
'Name': ['Alice', 'Bob', 'Charlie'],
'Age': [25, 30, 35],
'City': ['New York', 'San Francisco', 'Los Angeles']
}
df = DataFrame(data)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [87]:
df = DataFrame(data, index=['One','Two','Three'])
df

          Name  Age           City
One      Alice   25       New York
Two        Bob   30  San Francisco
Three  Charlie   35    Los Angeles

In [88]:
df[df['Age'] > 25]

          Name  Age           City
Two        Bob   30  San Francisco
Three  Charlie   35    Los Angeles

In [89]:
data = {
'Nevada': {2001: 2.4, 2002: 2.9},
'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}
}
data

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [90]:
df = pd.DataFrame(data)
df

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [91]:
df.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [92]:
df

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [93]:
df1 = DataFrame(df,index=[2001,2002,2003])
df1

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [94]:
df

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [95]:
df['Ohio']

2001    1.7
2002    3.6
2000    1.5
Name: Ohio, dtype: float64

In [96]:
df['Ohio'][:2]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [97]:
df.index.name='Year'; df.columns.name='State'
df

State  Nevada  Ohio
Year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [98]:
df.loc[2001]

State
Nevada    2.4
Ohio      1.7
Name: 2001, dtype: float64

In [99]:
data = {
"calories": [420, 380, 390],
"fruits": ['Apple', 'Cherry', 'Banana']
}
df = DataFrame(data, index=['Day1','Day2','Day3'])
df

      calories  fruits
Day1       420   Apple
Day2       380  Cherry
Day3       390  Banana

In [100]:
df.loc['Day2']

calories       380
fruits      Cherry
Name: Day2, dtype: object

In [101]:
s1 = df.loc['Day3']
s1

calories       390
fruits      Banana
Name: Day3, dtype: object

In [102]:
type(s1)

pandas.core.series.Series

In [103]:
s2 = df['calories']
s2

Day1    420
Day2    380
Day3    390
Name: calories, dtype: int64

In [104]:
type(s2)

pandas.core.series.Series